In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

/var/folders/1m/71syl3xd3910y8gqrq29f4w40000gn/T/ipykernel_73962/1285016483.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [4]:
df = pd.read_csv("employees.csv")

In [7]:
df.head()

  First Name  Gender  Salary Bonus % Senior Management             Team
0    Douglas    Male   97308   6.945              TRUE        Marketing
1     Thomas    Male   61933     NaN              TRUE              NaN
2      Maria  Female  130590  11.858             FALSE          Finance
3      Jerry    Male     NaN    9.34              TRUE          Finance
4      Larry    Male  101004   1.389              TRUE  Client Services

In [9]:
df.shape

(1000, 6)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         931 non-null    object
 1   Gender             852 non-null    object
 2   Salary             998 non-null    object
 3   Bonus %            997 non-null    object
 4   Senior Management  932 non-null    object
 5   Team               957 non-null    object
dtypes: object(6)
memory usage: 47.0+ KB

In [13]:
df.describe()

       First Name  Gender Salary Bonus % Senior Management             Team
count         931     852    998     997               932              957
unique        201       3    993     968                 4               13
top       Marilyn  Female  91462   8.999              TRUE  Client Services
freq           11     428      2       3               467              105

In [14]:
df['Gender'].unique()

array(['Male', 'Female', 'n.a.', nan], dtype=object)

In [15]:
df['Team'].unique()

array(['Marketing', nan, 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'na', 'Distribution', 'n.a.', '?'], dtype=object)

In [16]:
df['Senior Management'].unique()

array(['TRUE', 'FALSE', nan, 'n.a.', '?'], dtype=object)

In [17]:
df.isnull().sum()

First Name            69
Gender               148
Salary                 2
Bonus %                3
Senior Management     68
Team                  43
dtype: int64

In [28]:
malform = ['n.a.','?', 'NA', 'n/a', 'na', '--']

In [29]:
df=pd.read_csv("employees.csv", na_values=malform)

In [30]:
df.isnull().sum()

First Name            70
Gender               149
Salary                 5
Bonus %                4
Senior Management     71
Team                  48
dtype: int64

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         930 non-null    object
 1   Gender             851 non-null    object
 2   Salary             995 non-null    float64
 3   Bonus %            996 non-null    float64
 4   Senior Management  929 non-null    object
 5   Team               952 non-null    object
dtypes: float64(2), object(4)
memory usage: 47.0+ KB

In [32]:
def make_int(i):
    try:
        return(i)
    except:
        return np.nan

In [33]:
df["Salary"] = df["Salary"].map(make_int)

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         930 non-null    object
 1   Gender             851 non-null    object
 2   Salary             995 non-null    float64
 3   Bonus %            996 non-null    float64
 4   Senior Management  929 non-null    object
 5   Team               952 non-null    object
dtypes: float64(2), object(4)
memory usage: 47.0+ KB

In [35]:
df.describe()

              Salary     Bonus %
count     995.000000  996.000000
mean    90522.329648   10.215586
std     32880.654889    5.532077
min     35013.000000    1.015000
25%     62412.500000    5.429500
50%     90370.000000    9.850000
75%    118582.000000   14.841250
max    149908.000000   19.944000